package com.pozmaxpav.cinemaopinion.utilits

object Constants {

    const val API_KEY = "5e4f8238-a604-49f0-983e-3aafe93c33b3"
    const val API_KEY_DEV = "37HNDRB-HPPMG0S-JPQVFZJ-RQMTFPY"

    const val USER_SETTINGS = "userSettings"
    const val APP_ENTRY = "appEntry"

    val DEVELOPER_COMMENT = """
        1.  Добавлена возможность создавать совместные списки с другим пользователем.
    
        2.  Исправлено много ошибок. Приложение стало работать стабильнее.
    
        3.  Доработан интерфейс.
    """.trimIndent()

    const val NEW_YEAR_TEXT = "Впереди прекрасный период до самого светлого и чистого праздника. " +
            "Пусть этот период будет " +
            "наполнен только самыми прекрасными и радостными событиями. А это приложение позволит еще " +
            "ярче скоротать время. " +
            "Пусть все трудности и сложности уйдут на второй план. " +
            "Встречайте подборки с рождественскими фильмами, активности и постоянные " +
            "поздравления. В процессе пользования приложением будут попадаться интересные " +
            "факты и задачки, за выполнение которых вы будете зарабатывать баллы и получать награды. " +
            "Заработанные баллы будут заполнять шкалу “Новогоднего вдохновения”. Баллы будут начисляться " +
            "за просмотренные фильмы из новогодней подборки. После просмотра фильма нажмите кнопку " +
            "“Я посмотрел” и наполнитесь вдохновением, а приложение за это наполнит вашу копилку " +
            "с вдохновением."

    const val NEW_YEAR_TEXT_FOR_ALERT_DIALOG =
        "Добро пожаловать в Сезонное обновление.\n" +
                "\n" +
                "Новый год на пороге! Так встретим же его!"

    const val GENERAL_TEXT_FOR_ALERT_DIALOG =
        "Добро пожаловать в новую версию приложения!"
}