package com.pozmaxpav.cinemaopinion.utilits

object Constants {
    const val USER_SETTINGS = "userSettings"
    const val APP_ENTRY = "appEntry"
    const val DEVELOPER_COMMENT = "Что нового:\n" +
            "1.\tИсправлено и доработано много кода, отвечающего за интерфейс. Во многих местах интерфейс изменился.\n" +
            "2.\tПереработано окно выбора даты и месяца для фильтрации фильмов на главной странице.\n" +
            "3.\tДобавлена в бета режиме страница “Интересное”. Там можно прочитать последние новости в медиа секторе.\n" +
            "4.\tТеперь можно оставлять комментарии в личном списке для себя.\n" +
            "5.\tИсправлено много технических ошибок в приложении, теперь оно стало быстрее.\n" +
            "6.\tПереработано окно с расширенным поиском. Сам поиск по всему приложению стал умнее и точнее.\n" +
            "7.\t Переработана страница с выводом последних изменений.\n"
}

