package com.pozmaxpav.cinemaopinion.utilits

object Constants {
    const val USER_SETTINGS = "userSettings"
    const val APP_ENTRY = "appEntry"
    const val DEVELOPER_COMMENT = "Что нового:\n" +
            "1.\tДобавлен новый экран со списком просмотренных фильмов. Теперь просмотренные " +
            "фильмы можно переносить в отдельный список, чтобы освобождать место для новых " +
            "рекомендаций в общем. Для того, чтобы перенести фильм в состояние “просмотренный”, " +
            "необходимо в карточке с фильмом нажать на специальную кнопку “Просмотрен”. \n" +
            "2.\tДля того чтобы перейти в новый экран со списком просмотренных фильмов, " +
            "на экране с общим списком была добавлена кнопка “Просмотренные фильмы”.  \n" +
            "3.\tДобавлен наблюдатель для списка с фильмами в общем списке, чтобы обновление " +
            "интерфейса происходило сразу после внесения изменений.\n" +
            "4.\tТочечные доработки интерфейса и исправление незначительных ошибок в коде.\n"
    const val NEW_YEAR_TEXT = """
        Впереди прекрасный период до самого 
        светлого и чистого праздника. Пусть этот период будет наполнен только самыми 
        прекрасными и радостными событиями. А это приложение позволит еще ярче 
        скоротать время. Пусть все трудности и сложности уйдут на второй план. 
        Встречайте подборки с рождественскими фильмами, активности и постоянные 
        поздравления. В процессе пользования приложением будут попадаться интересные 
        факты и задачки за выполнение которых вы будете зарабатывать баллы и получать награды. 
        Заработанные баллы будут заполнять шкалу Новогоднего вдохновения. Баллы будут начисляться 
        за просмотренные фильмы из новогодней подборки. После просмотре нажмите кнопку Я посмотрел
        и наполнитесь вдохновением, а приложение за это наполнит вашу копилку с вдохновением.
    """
    const val TEXT_FOR_ALERT_DIALOG =
        "Добро пожаловать в Сезонное обновление.\n" +
                "\n" +
                "Новый год на пороге! Так встретим же его!"
}

