package com.pozmaxpav.cinemaopinion.utilits

object Constants {
    const val USER_SETTINGS = "userSettings"
    const val APP_ENTRY = "appEntry"
    const val DEVELOPER_COMMENT = "Что нового:\n" +
            "1.\tДобавлен новый экран со списком просмотренных фильмов. Теперь просмотренные " +
            "фильмы можно переносить в отдельный список, чтобы освобождать место для новых " +
            "рекомендаций в общем. Для того, чтобы перенести фильм в состояние “просмотренный”, " +
            "необходимо в карточке с фильмом нажать на специальную кнопку “Просмотрен”. \n" +
            "2.\tДля того чтобы перейти в новый экран со списком просмотренных фильмов, " +
            "на экране с общим списком была добавлена кнопка “Просмотренные фильмы”.  \n" +
            "3.\tДобавлен наблюдатель для списка с фильмами в общем списке, чтобы обновление " +
            "интерфейса происходило сразу после внесения изменений.\n" +
            "4.\tТочечные доработки интерфейса и исправление незначительных ошибок в коде.\n"
}

