package com.pozmaxpav.cinemaopinion.utilits

object Constants {
    const val USER_SETTINGS = "userSettings"

    const val APP_ENTRY = "appEntry"

    const val DEVELOPER_COMMENT = "Что нового:\n" +
            "1.\t   Добавлен новый список с сериалами, которые ждут продолжение. Теперь, чтобы не " +
            "засорять список с сериалами, после просмотра сезона его можно перенести в список " +
            "ожидания. В этом списке можно будет прочитать оставленные ранее комментарии и добавить " +
            "новые, а когда сериал будет завершен, то перенести его в просмотренные. \n"

    const val NEW_YEAR_TEXT = "Впереди прекрасный период до самого светлого и чистого праздника. " +
            "Пусть этот период будет " +
            "наполнен только самыми прекрасными и радостными событиями. А это приложение позволит еще " +
            "ярче скоротать время. " +
            "Пусть все трудности и сложности уйдут на второй план. " +
            "Встречайте подборки с рождественскими фильмами, активности и постоянные " +
            "поздравления. В процессе пользования приложением будут попадаться интересные " +
            "факты и задачки, за выполнение которых вы будете зарабатывать баллы и получать награды. " +
            "Заработанные баллы будут заполнять шкалу “Новогоднего вдохновения”. Баллы будут начисляться " +
            "за просмотренные фильмы из новогодней подборки. После просмотра фильма нажмите кнопку " +
            "“Я посмотрел” и наполнитесь вдохновением, а приложение за это наполнит вашу копилку " +
            "с вдохновением."

    const val NEW_YEAR_TEXT_FOR_ALERT_DIALOG =
        "Добро пожаловать в Сезонное обновление.\n" +
                "\n" +
                "Новый год на пороге! Так встретим же его!"

    const val GENERAL_TEXT_FOR_ALERT_DIALOG =
        "Добро пожаловать в новую версию приложения!"
}

