package com.pozmaxpav.cinemaopinion.utilits

object Constants {
    const val USER_SETTINGS = "userSettings"

    const val APP_ENTRY = "appEntry"

    const val DEVELOPER_COMMENT = "Что нового:\n" +
            "1.\tТеперь приложение запоминает, на каком фильме остановилось пролистывание списка с " +
            "фильмами и при открытии карточки фильма не возвращает список в самое начало. Работает " +
            "для любого списка в приложении.\n" +
            "2.\tДобавлено “Сезонное обновление”, в зависимости от ключевых событий, таких как, " +
            "например: Рождество и Новый год, будет меняться контент позволяющий наполниться духом " +
            "этого события. \n" +
            "3.\tАккаунт перенесен в облако. В будущем это позволит создавать персональные " +
            "совместные списки с любым пользователем. Более того, перенос данных о пользователе " +
            "позволит в перспективе создавать больше одного пользователя на одном устройстве, " +
            "позволит вести синхронную статистику между всеми участниками приложения, особенно это " +
            "применимо для конкурсов.\n" +
            "4.\tДобавлена первая активность в рамках “Сезонного обновления”, которое приурочено к " +
            "Рождеству и Новому Году. На главном экране приложения появился горизонтальный список " +
            "с Рождественскими фильмам. Если вы посмотрите фильм из этого списка и нажмете на " +
            "кнопку “Я посмотрел” в карточке этого фильма, то вам будут начислены баллы. Каждый " +
            "бал будет повышать ваш рейтинг в таблице чемпионов, и, что самое главное, повышать " +
            "ваше настроение и ваш уровень духовной наполненности. Задача стоит именно посмотреть, " +
            "если вы смотрели фильм ранее, то придется пересматривать, так как это не считается. " +
            "И за прохождение некоторых этапов будут начисляться персональные награды, которые " +
            "будут отображаться в личном кабинете, а в будущем этот функционал будет расширяться и " +
            "все награды перенесутся в зал славы, который смогут видеть все участники приложения, " +
            "еще одна возможность рассказать всем какой вы киноман.\n" +
            "5.\tДоработано отображение новостей на странице с Media.\n" +
            "6.\tПереработана логика отображения всех всплывающих окон.\n" +
            "7.\tВ личном списке в карточке фильма добавлено описание фильма.\n" +
            "8.\tПовышена скорость работы всего приложения.\n" +
            "9.\tЭто только малая часть нововведений, которые принесло это обновление. \n" +
            "\n" +
            "Что нас ждет в будущем:\n" +
            "1.\tВ скором времени я добавлю возможность просматривать трейлеры прямо в приложении.\n" +
            "2.\tБудет добавлена ролевая игра в формате викторины на знание фильмов. Контент будет разный.\n" +
            "3.\tБудут добавлены уведомления, чтобы не приходилось каждый раз проверять список изменений вручную. \n" +
            "4.\tБудут добавлены персональные награды, не связанные с “Сезонными обновлениями”. " +
            "Зарабатывать эти баллы можно будет разными способами. \n" +
            "5.\tБудет добавлен небольшой общий чат, не для отзывов, а для различной активности.\n"

    const val NEW_YEAR_TEXT = "Впереди прекрасный период до самого светлого и чистого праздника. " +
            "Пусть этот период будет " +
            "наполнен только самыми прекрасными и радостными событиями. А это приложение позволит еще " +
            "ярче скоротать время. " +
            "Пусть все трудности и сложности уйдут на второй план. " +
            "Встречайте подборки с рождественскими фильмами, активности и постоянные " +
            "поздравления. В процессе пользования приложением будут попадаться интересные " +
            "факты и задачки, за выполнение которых вы будете зарабатывать баллы и получать награды. " +
            "Заработанные баллы будут заполнять шкалу “Новогоднего вдохновения”. Баллы будут начисляться " +
            "за просмотренные фильмы из новогодней подборки. После просмотра фильма нажмите кнопку " +
            "“Я посмотрел” и наполнитесь вдохновением, а приложение за это наполнит вашу копилку " +
            "с вдохновением."

    const val TEXT_FOR_ALERT_DIALOG =
        "Добро пожаловать в Сезонное обновление.\n" +
                "\n" +
                "Новый год на пороге! Так встретим же его!"
}

