package com.example.core.utils

object CoreConstants {
    const val API_KEY = "5e4f8238-a604-49f0-983e-3aafe93c33b3"
    const val API_KEY_DEV = "37HNDRB-HPPMG0S-JPQVFZJ-RQMTFPY"

    val DEVELOPER_COMMENT = """
        1. Разработан серверный бекенд для приложения, обеспечивающий стабильную работу и расширяемость.
        
        2. Настроена система push-уведомлений, позволяющая пользователям получать актуальные уведомления о важных событиях.
        
        3. Исправлены несколько визуальных проблем, улучшена корректность отображения на разных экранах.
        
        4. Оптимизировано приложение для повышения производительности и улучшения скорости отклика.
        
        5. Проведены работы по исправлению ошибок в коде, что улучшило стабильность приложения и устранило существующие баги.
    """.trimIndent()


    const val NEW_YEAR_TEXT = "Впереди прекрасный период до самого светлого и чистого праздника. " +
            "Пусть этот период будет " +
            "наполнен только самыми прекрасными и радостными событиями. А это приложение позволит еще " +
            "ярче скоротать время. " +
            "Пусть все трудности и сложности уйдут на второй план. " +
            "Встречайте подборки с рождественскими фильмами, активности и постоянные " +
            "поздравления. В процессе пользования приложением будут попадаться интересные " +
            "факты и задачки, за выполнение которых вы будете зарабатывать баллы и получать награды. " +
            "Заработанные баллы будут заполнять шкалу “Новогоднего вдохновения”. Баллы будут начисляться " +
            "за просмотренные фильмы из новогодней подборки. После просмотра фильма нажмите кнопку " +
            "“Я посмотрел” и наполнитесь вдохновением, а приложение за это наполнит вашу копилку " +
            "с вдохновением."

    const val NEW_YEAR_TEXT_FOR_ALERT_DIALOG =
        "Добро пожаловать в Сезонное обновление.\n" +
                "\n" +
                "Новый год на пороге! Так встретим же его!"

    const val GENERAL_TEXT_FOR_ALERT_DIALOG = "Добро пожаловать в новую версию приложения!"
}